iNavFlight/inav/lib/main/STM32F7/Drivers/BSP/STM32F769I_EVAL/stm32f769i_eval_audio.c
    return AUDIO_OK;
  }
}

/**
  * @brief  Send n-Bytes on the SAI interface.
  * @param  pData: pointer on data address 
  * @param  Size: number of data to be written
  * @retval None
  */
void BSP_AUDIO_OUT_ChangeBuffer(uint16_t *pData, uint16_t Size)
{
   HAL_SAI_Transmit_DMA(&haudio_out_sai, (uint8_t*) pData, Size);
}

/**
  * @brief  Pause the audio file stream. In case
  *         of using DMA, the DMA Pause feature is used.
  * @note  When calling BSP_AUDIO_OUT_Pause() function for pause, only
  *          BSP_AUDIO_OUT_Resume() function should be called for resume (use of BSP_AUDIO_OUT_Play() 
  *          function for resume could lead to unexpected behaviour).
  * @retval AUDIO_OK if correct communication, else wrong communication
  */
uint8_t BSP_AUDIO_OUT_Pause(void)
{
  uint8_t ret = 0;
#if defined(USE_LCD_HDMI)  
  /* ADV7533 used */
  if((AudioOut_Device & OUTPUT_DEVICE_HDMI) == OUTPUT_DEVICE_HDMI)
  {
    if(DeviceId == ADV7533_ID)
    {    
      /* Call the audio Codec Pause function */
      if(hdmi_drv->Pause(ADV7533_MAIN_I2C_ADDR) != 0)
      {  
        ret = AUDIO_ERROR;
      }
    }
  }
#endif /* USE_LCD_HDMI */

  /* WM8994 used */
  if((((AudioOut_Device & OUTPUT_DEVICE_BOTH) > 0) && 
     ((AudioOut_Device & OUTPUT_DEVICE_BOTH) <= OUTPUT_DEVICE_BOTH)) ||
     ((AudioOut_Device & OUTPUT_DEVICE_AUTO) == OUTPUT_DEVICE_AUTO))
  {  
    /* Call the audio Codec Pause function */
    if(audio_drv->Pause(AUDIO_I2C_ADDRESS) != 0)
    {  
      ret = AUDIO_ERROR;
    } 
  }

  if(ret == AUDIO_ERROR)
  {
    return AUDIO_ERROR;
  }
  else
  {
    /* Call the Media layer pause function */
    HAL_SAI_DMAPause(&haudio_out_sai);
    
    /* Return AUDIO_OK when all operations are correctly done */
    return AUDIO_OK;
  }
}

/**
  * @brief  Resume the audio file stream.  
  * @note   When calling BSP_AUDIO_OUT_Pause() function for pause, only
  *          BSP_AUDIO_OUT_Resume() function should be called for resume (use of BSP_AUDIO_OUT_Play() 
  *          function for resume could lead to unexpected behaviour).
  * @retval AUDIO_OK if correct communication, else wrong communication
  */
uint8_t BSP_AUDIO_OUT_Resume(void)
{
  uint8_t ret = 0;
#if defined(USE_LCD_HDMI)  
  /* ADV7533 used */
  if((AudioOut_Device & OUTPUT_DEVICE_HDMI) == OUTPUT_DEVICE_HDMI)
  {
    if(DeviceId == ADV7533_ID)
    {    
      /* Call the audio Codec Resume function */
      if(hdmi_drv->Resume(ADV7533_MAIN_I2C_ADDR) != 0)
      {  
        ret = AUDIO_ERROR;
      }
    }
  }
#endif /* USE_LCD_HDMI */

  /* WM8994 used */
  if((((AudioOut_Device & OUTPUT_DEVICE_BOTH) > 0) && 
     ((AudioOut_Device & OUTPUT_DEVICE_BOTH) <= OUTPUT_DEVICE_BOTH)) ||
     ((AudioOut_Device & OUTPUT_DEVICE_AUTO) == OUTPUT_DEVICE_AUTO))
  {  
    /* Call the audio Codec Resume function */
    if(audio_drv->Resume(AUDIO_I2C_ADDRESS) != 0)
    {  
      ret = AUDIO_ERROR;
    } 
  }

  if(ret == AUDIO_ERROR)
  {
    return AUDIO_ERROR;
  }
  else
  {
    /* Call the Media layer pause/resume function */
    HAL_SAI_DMAResume(&haudio_out_sai);
    
    /* Return AUDIO_OK when all operations are correctly done */
    return AUDIO_OK;
  }
}

/**
  * @brief  Stop audio playing and Power down the Audio Codec. 
  * @param  Option: could be one of the following parameters 
  *           - CODEC_PDWN_SW: for software power off (by writing registers). 
  *                            Then no need to reconfigure the Codec after power on.
  *           - CODEC_PDWN_HW: completely shut down the codec (physically). 
  *                            Then need to reconfigure the Codec after power on.  
  * @retval AUDIO_OK if correct communication, else wrong communication
  */
uint8_t BSP_AUDIO_OUT_Stop(uint32_t Option)
{
  uint8_t ret = 0;

  /* Call the Media layer stop function */
  HAL_SAI_DMAStop(&haudio_out_sai);

#if defined(USE_LCD_HDMI)
  /* ADV7533 used */
  if((AudioOut_Device & OUTPUT_DEVICE_HDMI) == OUTPUT_DEVICE_HDMI)
  {
    if(DeviceId == ADV7533_ID)
    {    
      /* Call the audio Codec Stop function */
      if(hdmi_drv->Stop(ADV7533_MAIN_I2C_ADDR, Option) != 0)
      {  
        ret = AUDIO_ERROR;
      }
    }
  }
#endif /* USE_LCD_HDMI */

  /* WM8994 used */
  if((((AudioOut_Device & OUTPUT_DEVICE_BOTH) > 0) && 
     ((AudioOut_Device & OUTPUT_DEVICE_BOTH) <= OUTPUT_DEVICE_BOTH)) ||
     ((AudioOut_Device & OUTPUT_DEVICE_AUTO) == OUTPUT_DEVICE_AUTO))
  {  
    /* Call the audio Codec Stop function */
    if(audio_drv->Stop(AUDIO_I2C_ADDRESS, Option) != 0)
    {  
      ret = AUDIO_ERROR;
    } 
  }
  
  if(ret == AUDIO_ERROR)
  {
    return AUDIO_ERROR;
  }
  else
  {
    if(Option == CODEC_PDWN_HW)
    { 
      /* Wait at least 100us */
      HAL_Delay(1);
    }
    /* Return AUDIO_OK when all operations are correctly done */
    return AUDIO_OK;
  }
}

/**
  * @brief  Control the current audio volume level. 
  * @param  Volume: Volume level to be set in percentage from 0% to 100% (0 for 
  *         Mute and 100 for Max volume level).
  * @retval AUDIO_OK if correct communication, else wrong communication
  */
uint8_t BSP_AUDIO_OUT_SetVolume(uint8_t Volume)
{
  /* Call the codec volume control function with converted volume value */
  if(audio_drv->SetVolume(AUDIO_I2C_ADDRESS, Volume) != 0)
  {
    return AUDIO_ERROR;
  }
  else
  {
    /* Return AUDIO_OK when all operations are correctly done */
    return AUDIO_OK;
  }
}

/**
  * @brief  Enable or disable the MUTE mode by software 
  * @param  Cmd: Could be AUDIO_MUTE_ON to mute sound or AUDIO_MUTE_OFF to 
  *         unmute the codec and restore previous volume level.
  * @retval AUDIO_OK if correct communication, else wrong communication
  */
uint8_t BSP_AUDIO_OUT_SetMute(uint32_t Cmd)
{
  uint8_t ret = 0;
#if defined(USE_LCD_HDMI)  
  /* ADV7533 used */
  if((AudioOut_Device & OUTPUT_DEVICE_HDMI) == OUTPUT_DEVICE_HDMI)
  {
    if(DeviceId == ADV7533_ID)
    {    
      /* Call the audio Codec SetMute function */
      if(hdmi_drv->SetMute(ADV7533_MAIN_I2C_ADDR, Cmd) != 0)
      {  
        ret = AUDIO_ERROR;
      }
    }
  }
#endif /* USE_LCD_HDMI */

  /* WM8994 used */
  if((((AudioOut_Device & OUTPUT_DEVICE_BOTH) > 0) && 
      ((AudioOut_Device & OUTPUT_DEVICE_BOTH) <= OUTPUT_DEVICE_BOTH)) ||
     ((AudioOut_Device & OUTPUT_DEVICE_AUTO) == OUTPUT_DEVICE_AUTO))
  {  
    /* Call the audio Codec SetMute function */
    if(audio_drv->SetMute(AUDIO_I2C_ADDRESS, Cmd) != 0)
    {  
      ret = AUDIO_ERROR;
    } 
  }
  
  if(ret == AUDIO_ERROR)
  {
    return AUDIO_ERROR;
  }
  else
  {
    /* Return AUDIO_OK when all operations are correctly done */
    return AUDIO_OK;
  }
}

/**
  * @brief  Switch dynamically (while audio file is played) the output target 
  *         (speaker or headphone).
  * @param  Output: The audio output target: OUTPUT_DEVICE_SPEAKER,
  *         OUTPUT_DEVICE_HEADPHONE or OUTPUT_DEVICE_BOTH
  * @retval AUDIO_OK if correct communication, else wrong communication
  */
uint8_t BSP_AUDIO_OUT_SetOutputMode(uint8_t Output)
{
  /* Call the Codec output device function */
  if(audio_drv->SetOutputMode(AUDIO_I2C_ADDRESS, Output) != 0)
  {
    return AUDIO_ERROR;
  }
  else
  {
    /* Return AUDIO_OK when all operations are correctly done */
    return AUDIO_OK;
  }
}

/**
  * @brief  Update the audio frequency.
  * @param  AudioFreq: Audio frequency used to play the audio stream.
  * @note   This API should be called after the BSP_AUDIO_OUT_Init() to adjust the
  *         audio frequency.
  * @retval None
  */
void BSP_AUDIO_OUT_SetFrequency(uint32_t AudioFreq)
{ 
  /* PLL clock is set depending by the AudioFreq (44.1khz vs 48khz groups) */ 
  BSP_AUDIO_OUT_ClockConfig(&haudio_out_sai, AudioFreq, NULL);

